{"keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"use_bias": true, "padding": "valid", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv1d_116", "strides": [3], "trainable": true, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 128, 1], "bias_regularizer": null, "activation": "hard_sigmoid", "kernel_constraint": null, "kernel_size": [3], "filters": 4, "dilation_rate": [1]}}, {"class_name": "Conv1D", "config": {"use_bias": true, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv1d_117", "strides": [1], "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "hard_sigmoid", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3], "filters": 8, "dilation_rate": [1]}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [1], "name": "max_pooling1d_93", "pool_size": [1], "trainable": true}}, {"class_name": "Conv1D", "config": {"use_bias": true, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv1d_118", "strides": [1], "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "hard_sigmoid", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [5], "filters": 16, "dilation_rate": [1]}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [1], "name": "max_pooling1d_94", "pool_size": [1], "trainable": true}}, {"class_name": "Conv1D", "config": {"use_bias": true, "padding": "same", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "conv1d_119", "strides": [1], "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "hard_sigmoid", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [7], "filters": 32, "dilation_rate": [1]}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [3], "name": "max_pooling1d_95", "pool_size": [3], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "name": "dropout_24", "trainable": true, "rate": 0.5}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [360, 128, 1], "recurrent_dropout": 0.0, "dropout": 0.0, "implementation": 1, "activation": "tanh", "recurrent_regularizer": null, "units": 1024, "name": "lstm_24", "recurrent_activation": "hard_sigmoid", "use_bias": true, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "return_state": false, "trainable": true, "bias_constraint": null, "go_backwards": false, "dtype": "float32", "bias_regularizer": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "return_sequences": false, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "units": 1, "name": "dense_24"}}]}